Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/atdf/PIC32CK1025GC00064.atdf
      <value-group name="ID_ISAR0__BitCount">
        <value name="CLZ" caption="CLZ supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__BitField">
        <value name="YES" caption="BFC, BFI, SBFX, and UBFX supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__CmpBranch">
        <value name="YES" caption="CBNZ and CBZ supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__Coproc">
        <value name="NO" caption="Only FPU coprocessor instructions" value="0"/>
        <value name="YES" caption="Coprocessor instructions supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__Debug">
        <value name="BKPT" caption="BKPT supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__Divide">
        <value name="YES" caption="SDIC and UDIV supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR1__Extend">
        <value name="YES" caption="SXTB, SXTH, UXTB, UXTH supported" value="1"/>
        <value name="DSP" caption="SXTB16, SXTAB, SXTAB16, SXTAH, UXTB16, iUXTAB, UXTAB16, and UXTAH supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR1__IfThen">
        <value name="IT" caption="IT supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR1__Immediate">
        <value name="YES" caption="ADDW, MOVW, MOVT, and SUBW supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR1__Interwork">
        <value name="YES" caption="BLX, BX, and loads to PC supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__LoadStore">
        <value name="YES" caption="Load-acquire, store-release, and exclusive load and store supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__MemHint">
        <value name="YES" caption="PLI and PLD supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR2__MultiAccessInt">
        <value name="NO" caption="LDM and STM are not interruptible" value="0"/>
        <value name="RESTART" caption="LDM and STM are restartable" value="1"/>
        <value name="CONTINUE" caption="LDM and STM are continuable" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__Mult">
        <value name="YES" caption="MUL, MLA, and MLS supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__MultS">
        <value name="YES" caption="SMULL and SMLAL supported" value="1"/>
        <value name="DSP" caption="All saturating and DSP signed multiplies supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR2__MultU">
        <value name="YES" caption="UMULL and UMLAL supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__Reversal">
        <value name="YES" caption="REV, REV16, REVSH, and RBIT supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR3__Saturate">
        <value name="NO" caption="No saturating instructions supported" value="0"/>
        <value name="DSP" caption="QADD, QDADD, QDSYB, QSUB and Q-bit supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR3__SIMD">
        <value name="YES" caption="SSAT, USAT, and Q-bit supported" value="1"/>
        <value name="DSP" caption="All packed arithmetic and GE-bits supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR3__SVC">
        <value name="YES" caption="SVC supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR3__SynchPrim">
        <value name="YES" caption="LDREX, STREX, LDREXB, STREXB, LDREXH, STREXH, and CLREX supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR3__TabBranch">
        <value name="YES" caption="TBB and TBH supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR3__T32Copy">
        <value name="YES" caption="Encoding T1 of MOV (register) supports copying low register to low register" value="1"/>
      </value-group>
      <value-group name="ID_ISAR3__TrueNOP">
        <value name="YES" caption="NOP instruction and compatible hints supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR4__Unpriv">
        <value name="YES" caption="LDRBT, LDRHT, LDRSBT, LDRSHT, LDRT, STRBT, STRHT, and STRT supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR4__WithShifts">
        <value name="YES" caption="Constant shifts on load/store and other instructions supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR4__Writeback">
        <value name="YES" caption="All writeback addressing modes supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR4__Barrier">
        <value name="YES" caption="DMB, DSB, and ISB supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR4__SyncPrim_frac">
        <value name="YES" caption="LDREX, STREX, CLREX, LDREXB, LDREXH, STREXB, and STREXH supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR4__PSR_M">
        <value name="YES" caption="M profile forms of CPS, MRS, and MSR supported" value="1"/>
      </value-group>
      <value-group name="CLIDR__Ctype">
        <value name="NO" caption="No cache" value="0"/>
        <value name="IC" caption="Instruction cache only" value="1"/>
        <value name="DC" caption="Data cache only" value="2"/>
        <value name="SEPARATE" caption="Separate instruction and data caches" value="3"/>
        <value name="UNIFIED" caption="Unified cache" value="4"/>
      </value-group>
      <value-group name="CLIDR__ICB">
        <value name="NO" caption="Not disclosed in this mechanism" value="0"/>
        <value name="L1" caption="L1 cache is the highest inner level" value="1"/>
        <value name="L2" caption="L2 cache is the highest inner level" value="2"/>
        <value name="L3" caption="L3 cache is the highest inner level" value="3"/>
      </value-group>
      <value-group name="CTR__Format">
        <value name="NO" caption="No cache type information provided" value="0"/>
        <value name="YES" caption="Cache type information is provided" value="4"/>
      </value-group>
    </module>
    <module name="SDMMC" id="03592" name2="emb_sdmmc_v2" version="2a0" caption="SD/MMC Host Controller">
      <register-group name="SDMMC" caption="SD/MMC Host Controller">
        <register name="SSAR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SDMA System Address / Argument 2">
          <mode name="CMD23"/>
          <mode name="DEFAULT"/>
          <bitfield modes="DEFAULT" name="ADDR" caption="SDMA System Address" mask="0xFFFFFFFF"/>
          <bitfield modes="CMD23" name="ARG2" caption="Argument 2" mask="0xFFFFFFFF"/>
        </register>
        <register name="BSR" offset="0x4" rw="RW" size="2" access-size="2" initval="0x0000" caption="Block Size">
          <bitfield name="BLOCKSIZE" caption="Transfer Block Size" mask="0x3FF"/>
          <bitfield name="BOUNDARY" caption="SDMA Buffer Boundary" mask="0x7000" values="BSR__BOUNDARY"/>
        </register>
