Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/atdf/PIC32CK1025GC00064.atdf
        <register name="BCR" offset="0x6" rw="RW" size="2" access-size="2" initval="0x0000" caption="Block Count">
          <bitfield name="BCNT" caption="Blocks Count for Current Transfer" mask="0xFFFF"/>
        </register>
        <register name="ARG1R" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Argument 1">
          <bitfield name="ARG" caption="Argument 1" mask="0xFFFFFFFF"/>
        </register>
        <register name="TMR" offset="0xC" rw="RW" size="2" access-size="2" initval="0x0000" caption="Transfer Mode">
          <bitfield name="DMAEN" caption="DMA Enable" mask="0x1" values="TMR__DMAEN"/>
          <bitfield name="BCEN" caption="Block Count Enable" mask="0x2" values="TMR__BCEN"/>
          <bitfield name="ACMDEN" caption="Auto Command Enable" mask="0xC" values="TMR__ACMDEN"/>
          <bitfield name="DTDSEL" caption="Data Transfer Direction Selection" mask="0x10" values="TMR__DTDSEL"/>
          <bitfield name="MSBSEL" caption="Multi/Single Block Selection" mask="0x20" values="TMR__MSBSEL"/>
        </register>
        <register name="CR" offset="0xE" rw="RW" size="2" access-size="2" initval="0x0000" caption="Command">
          <bitfield name="RESPTYP" caption="Response Type" mask="0x3" values="CR__RESPTYP"/>
          <bitfield name="CMDCCEN" caption="Command CRC Check Enable" mask="0x8" values="CR__CMDCCEN"/>
          <bitfield name="CMDICEN" caption="Command Index Check Enable" mask="0x10" values="CR__CMDICEN"/>
          <bitfield name="DPSEL" caption="Data Present Select" mask="0x20" values="CR__DPSEL"/>
          <bitfield name="CMDTYP" caption="Command Type" mask="0xC0" values="CR__CMDTYP"/>
          <bitfield name="CMDIDX" caption="Command Index" mask="0x3F00"/>
        </register>
        <register name="RR" offset="0x10" rw="R" size="4" access-size="4" count="4" initval="0x00000000" caption="Response">
          <bitfield name="CMDRESP" caption="Command Response" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDPR" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Buffer Data Port">
          <bitfield name="BUFDATA" caption="Buffer Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="PSR" offset="0x24" rw="R" size="4" access-size="4" initval="0x00F80000" caption="Present State">
          <bitfield name="CMDINHC" caption="Command Inhibit (CMD)" mask="0x1" values="PSR__CMDINHC"/>
          <bitfield name="CMDINHD" caption="Command Inhibit (DAT)" mask="0x2" values="PSR__CMDINHD"/>
          <bitfield name="DLACT" caption="DAT Line Active" mask="0x4" values="PSR__DLACT"/>
          <bitfield name="RTREQ" caption="Re-Tuning Request" mask="0x8" values="PSR__RTREQ"/>
          <bitfield name="WTACT" caption="Write Transfer Active" mask="0x100" values="PSR__WTACT"/>
          <bitfield name="RTACT" caption="Read Transfer Active" mask="0x200" values="PSR__RTACT"/>
          <bitfield name="BUFWREN" caption="Buffer Write Enable" mask="0x400" values="PSR__BUFWREN"/>
          <bitfield name="BUFRDEN" caption="Buffer Read Enable" mask="0x800" values="PSR__BUFRDEN"/>
          <bitfield name="CARDINS" caption="Card Inserted" mask="0x10000" values="PSR__CARDINS"/>
          <bitfield name="CARDSS" caption="Card State Stable" mask="0x20000" values="PSR__CARDSS"/>
          <bitfield name="CARDDPL" caption="Card Detect Pin Level" mask="0x40000" values="PSR__CARDDPL"/>
          <bitfield name="WRPPL" caption="Write Protect Pin Level" mask="0x80000" values="PSR__WRPPL"/>
          <bitfield name="DATLL" caption="DAT[3:0] Line Level" mask="0xF00000"/>
          <bitfield name="CMDLL" caption="CMD Line Level" mask="0x1000000"/>
        </register>
        <register name="HC1R" offset="0x28" rw="RW" size="1" access-size="1" initval="0x00" caption="Host Control 1">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield modes="DEFAULT" name="LEDCTRL" caption="LED Control" mask="0x1" values="HC1R__LEDCTRL"/>
          <bitfield name="DW" caption="Data Width" mask="0x2" values="HC1R__DW"/>
          <bitfield name="HSEN" caption="High Speed Enable" mask="0x4" values="HC1R__HSEN"/>
          <bitfield name="DMASEL" caption="DMA Select" mask="0x18" values="HC1R__DMASEL"/>
          <bitfield modes="DEFAULT" name="CARDDTL" caption="Card Detect Test Level" mask="0x40" values="HC1R__CARDDTL"/>
          <bitfield modes="DEFAULT" name="CARDDSEL" caption="Card Detect Signal Selection" mask="0x80" values="HC1R__CARDDSEL"/>
        </register>
        <register name="PCR" offset="0x29" rw="RW" size="1" access-size="1" initval="0x0E" caption="Power Control">
          <bitfield name="SDBPWR" caption="SD Bus Power" mask="0x1" values="PCR__SDBPWR"/>
          <bitfield name="SDBVSEL" caption="SD Bus Voltage Select" mask="0xE" values="PCR__SDBVSEL"/>
        </register>
        <register name="BGCR" offset="0x2A" rw="RW" size="1" access-size="1" initval="0x00" caption="Block Gap Control">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="STPBGR" caption="Stop at Block Gap Request" mask="0x1" values="BGCR__STPBGR"/>
          <bitfield name="CONTR" caption="Continue Request" mask="0x2" values="BGCR__CONTR"/>
          <bitfield modes="DEFAULT" name="RWCTRL" caption="Read Wait Control" mask="0x4" values="BGCR__RWCTRL"/>
          <bitfield modes="DEFAULT" name="INTBG" caption="Interrupt at Block Gap" mask="0x8" values="BGCR__INTBG"/>
        </register>
        <register name="WCR" offset="0x2B" rw="RW" size="1" access-size="1" initval="0x00" caption="Wakeup Control">
          <bitfield name="WKENCINT" caption="Wakeup Event Enable on Card Interrupt" mask="0x1" values="WCR__WKENCINT"/>
          <bitfield name="WKENCINS" caption="Wakeup Event Enable on Card Insertion" mask="0x2" values="WCR__WKENCINS"/>
          <bitfield name="WKENCREM" caption="Wakeup Event Enable on Card Removal" mask="0x4" values="WCR__WKENCREM"/>
        </register>
        <register name="CCR" offset="0x2C" rw="RW" size="2" access-size="2" initval="0x0000" caption="Clock Control">
          <bitfield name="INTCLKEN" caption="Internal Clock Enable" mask="0x1" values="CCR__INTCLKEN"/>
          <bitfield name="INTCLKS" caption="Internal Clock Stable" mask="0x2" values="CCR__INTCLKS"/>
          <bitfield name="SDCLKEN" caption="SD Clock Enable" mask="0x4" values="CCR__SDCLKEN"/>
          <bitfield name="CLKGSEL" caption="Clock Generator Select" mask="0x20" values="CCR__CLKGSEL"/>
          <bitfield name="USDCLKFSEL" caption="Upper Bits of SDCLK Frequency Select" mask="0xC0"/>
          <bitfield name="SDCLKFSEL" caption="SDCLK Frequency Select" mask="0xFF00"/>
        </register>
        <register name="TCR" offset="0x2E" rw="RW" size="1" access-size="1" initval="0x00" caption="Timeout Control">
          <bitfield name="DTCVAL" caption="Data Timeout Counter Value" mask="0xF"/>
        </register>
        <register name="SRR" offset="0x2F" rw="RW" size="1" access-size="1" initval="0x00" caption="Software Reset">
          <bitfield name="SWRSTALL" caption="Software Reset For All" mask="0x1" values="SRR__SWRSTALL"/>
          <bitfield name="SWRSTCMD" caption="Software Reset For CMD Line" mask="0x2" values="SRR__SWRSTCMD"/>
          <bitfield name="SWRSTDAT" caption="Software Reset For DAT Line" mask="0x4" values="SRR__SWRSTDAT"/>
        </register>
        <register name="NISTR" offset="0x30" rw="RW" size="2" access-size="2" initval="0x0000" caption="Normal Interrupt Status">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDC" caption="Command Complete" mask="0x1" values="NISTR__CMDC"/>
          <bitfield name="TRFC" caption="Transfer Complete" mask="0x2" values="NISTR__TRFC"/>
          <bitfield name="BLKGE" caption="Block Gap Event" mask="0x4" values="NISTR__BLKGE"/>
          <bitfield name="DMAINT" caption="DMA Interrupt" mask="0x8" values="NISTR__DMAINT"/>
          <bitfield name="BWRRDY" caption="Buffer Write Ready" mask="0x10" values="NISTR__BWRRDY"/>
          <bitfield name="BRDRDY" caption="Buffer Read Ready" mask="0x20" values="NISTR__BRDRDY"/>
          <bitfield modes="DEFAULT" name="CINS" caption="Card Insertion" mask="0x40" values="NISTR__CINS"/>
          <bitfield modes="DEFAULT" name="CREM" caption="Card Removal" mask="0x80" values="NISTR__CREM"/>
          <bitfield modes="DEFAULT" name="CINT" caption="Card Interrupt" mask="0x100" values="NISTR__CINT"/>
          <bitfield modes="EMMC" name="BOOTAR" caption="Boot Acknowledge Received" mask="0x4000"/>
          <bitfield name="ERRINT" caption="Error Interrupt" mask="0x8000" values="NISTR__ERRINT"/>
        </register>
